In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('educ_inc.csv')
df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,00 to 17,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,00 to 17,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,65 to 80+,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,65 to 80+,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,00 to 17,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,18 to 64,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,18 to 64,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,18 to 64,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

# First Question

###  1. Group the table by Educational Attainment and sum the Population Count in each category(2).

In [4]:
df.groupby(by = 'Educational Attainment').sum()

/var/folders/21/yhy2dhmx219b7cbcq243hmwc0000gn/T/ipykernel_31663/3077933478.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(by = 'Educational Attainment').sum()

                                Population Count
Educational Attainment
Bachelor's degree or higher             54617676
College, less than 4-yr degree          52137494
High school or equivalent               42942926
No high school diploma                  40668871

### 2. Analyse the percentage distribution of educational attainment among adult Californians(2).

In [6]:
df['Age'].value_counts()

18 to 64     448
65 to 80+    444
00 to 17     134
Name: Age, dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Age'] = le.fit_transform(df['Age'])
df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,0,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,0,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,2,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,2,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,0,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,1,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,1,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,1,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,1,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,1,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

In [9]:
df_adult = df[df['Age']>=1]

In [10]:
df_adult

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
2,1/1/08 0:00,2,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,2,Female,No high school diploma,"H: 75,000 and over",1981
9,1/1/08 0:00,1,Female,No high school diploma,"H: 75,000 and over",4233
11,1/1/08 0:00,2,Male,No high school diploma,"H: 75,000 and over",5801
16,1/1/08 0:00,2,Female,No high school diploma,"F: 35,000 to 49,999",8109
...,...,...,...,...,...,...
1021,1/1/14 0:00,1,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,1,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,1,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,1,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,1,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

In [16]:
obj = pd.DataFrame(df_adult.groupby('Educational Attainment')['Population Count'].sum())

In [18]:
obj

                                Population Count
Educational Attainment
Bachelor's degree or higher             54603003
College, less than 4-yr degree          52045952
High school or equivalent               42828045
No high school diploma                  31102348

In [20]:
s = obj['Population Count'].sum()
print(s)
obj['Percentage Distribution']= obj['Population Count']/s

180579348

In [21]:
obj

                                Population Count  Percentage Distribution
Educational Attainment
Bachelor's degree or higher             54603003                 0.302377
College, less than 4-yr degree          52045952                 0.288217
High school or equivalent               42828045                 0.237170
No high school diploma                  31102348                 0.172236

In [22]:
obj['Percentage Distribution']

Educational Attainment
Bachelor's degree or higher       0.302377
College, less than 4-yr degree    0.288217
High school or equivalent         0.237170
No high school diploma            0.172236
Name: Percentage Distribution, dtype: float64

### 3. Using pivot , get a contingency table (a table of counts) of adult Californians cross-classified by Educational Attainment and Personal Income(2).

# Second Question